// forEach
// const ff = (a ) => {
//     console.log(` Я элемент с индексом ${a}`);// шаблонная строка

// }


// const arrF = [1, 2, 3, 5, 4,10,6];
// arrF.forEach(ff);// 7 раз запускает функцию FF для каждого элемента массива. Она не возвращает ничего, 
// а просто выводит каждый элемент массива
const ff = (a) => {
    console.log(` ${a}`);//КАЖДЫЙ РАз КАКаргумент будет выдавать ногвый элемент массива- цикл
}

const arrF = [1, 2, 3, 5, 4, 10, 6];
arrF.forEach(ff);
// посчитать сумму  всехэлементов массива
let sum = 0;
arrC.forEach((a) => {
    sum += a;
})
console.log(sum);


const arrC = [1, 2, 3, 5, 4, 10, 6];
arrC.forEach(ff);


